import random
monsters = [{"name":"狼","hp":100,"attack":10,"exp":10,"money":10,"mightdrop":["木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","铁剑"]},
                {"name":"狼王","hp":200,"attack":20,"exp":20,"money":20,"mightdrop":["木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","铁剑","屠龙宝刀"]},
                {"name":"史莱姆","hp":50,"attack":5,"exp":5,"money":5,"mightdrop":["经验书","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑"]},
                {"name":"史莱姆王","hp":100,"attack":10,"exp":10,"money":10,"mightdrop":["经验书","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","铁剑"]},
                {"name":"骷髅","hp":150,"attack":15,"exp":15,"money":15,"mightdrop":["经验书","木剑","铁剑"]},
                {"name":"骷髅王","hp":200,"attack":20,"exp":20,"money":20,"mightdrop":["经验书","木剑","铁剑","屠龙宝刀""木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","木剑","铁剑","木剑","铁剑","木剑","铁剑"]},
                {"name":"嘤嘤怪","hp":5,"attack":1,"exp":1,"money":1,"mightdrop":["经验书","木剑","铁剑","屠龙宝刀","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑"]},
                {"name":"树人","hp":300,"attack":30,"exp":30,"money":30,"mightdrop":["经验书","木剑","铁剑","屠龙宝刀","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑"]},
                {"name":"树精","hp":400,"attack":40,"exp":40,"money":40,"mightdrop":["经验书","木剑","铁剑","屠龙宝刀","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑"]},
                {"name":"树精王","hp":500,"attack":50,"exp":50,"money":50,"mightdrop":["经验书","木剑","铁剑","屠龙宝刀","生命水晶","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑"]},
                {"name":"蜘蛛","hp":100,"attack":10,"exp":10,"money":10,"mightdrop":["经验书","木剑","铁剑","屠龙宝刀","生命水晶","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑"]},
                {"name":"蜘蛛王","hp":200,"attack":20,"exp":20,"money":20,"mightdrop":["经验书","木剑","铁剑","屠龙宝刀","生命水晶","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑"]},
                {"name":"蝙蝠","hp":100,"attack":10,"exp":10,"money":10,"mightdrop":["经验书","木剑","铁剑","屠龙宝刀","生命水晶","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑"]},
                {"name":"蝙蝠王","hp":200,"attack":20,"exp":20,"money":20,"mightdrop":["经验书","木剑","铁剑","屠龙宝刀","生命水晶","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑"]},
                {"name":"蜈蚣","hp":100,"attack":10,"exp":10,"money":10,"mightdrop":["经验书","木剑","铁剑","屠龙宝刀","生命水晶","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑"]},
                {"name":"蜈蚣王","hp":200,"attack":20,"exp":20,"money":20,"mightdrop":["经验书","木剑","铁剑","屠龙宝刀","生命水晶","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑"]},
                {"name":"石头人","hp":1000,"attack":10,"exp":10,"money":10,"mightdrop":["经验书","木剑","铁剑","屠龙宝刀","生命水晶","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑"]},
                {"name":"鸡","hp":1,"attack":1,"exp":1,"money":10,"mightdrop":["木剑","铁剑","篮球","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑"]},
                {"name":"鸭","hp":1,"attack":1,"exp":1,"money":10,"mightdrop":["木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑"]},
                {"name":"鹅","hp":5,"attack":2,"exp":1,"money":10,"mightdrop":["木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑"]},
                {"name":"鹅王","hp":10,"attack":5,"exp":5,"money":10,"mightdrop":["木剑","铁剑","经验书","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑"]},
                {"name":"乌龟","hp":100,"attack":1,"exp":50,"money":10,"mightdrop":["木剑","铁剑","经验书","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑"]},
                {"name":"乌龟王","hp":200,"attack":2,"exp":100,"money":10,"mightdrop":["木剑","铁剑","经验书","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑"]},
                {"name":"蛇","hp":10,"attack":100,"exp":50,"money":10,"mightdrop":["木剑","铁剑","经验书","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑"]},
                {"name":"蛇王","hp":20,"attack":200,"exp":100,"money":10,"mightdrop":["木剑","铁剑","经验书","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑"]},
                {"name":"蜥蜴","hp":10,"attack":10,"exp":50,"money":10,"mightdrop":["木剑","铁剑","经验书","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑","木剑","铁剑"]},
                {"name":"蜥蜴王","hp":20,"attack":20,"exp":100,"money":10,"mightdrop":["木剑","铁剑","经验书"]},
                {"name":"哥布林","hp":40,"attack":10,"exp":10,"money":40,"mightdrop":["木剑","铁剑","经验书"]},
                {"name":"经验怪","hp":30,"attack":10,"exp":100,"money":10,"mightdrop":["经验书","经验书","经验书"]},
                {"name":"小鸡","hp":1,"attack":1,"exp":1,"money":1,"mightdrop":["篮球"]},
                {"name":"小鸭","hp":1,"attack":1,"exp":1,"money":1,"mightdrop":["篮球"]},
                {"name":"小鹅","hp":1,"attack":1,"exp":1,"money":1,"mightdrop":["篮球"]},
                {"name":"必杀怪","hp":9999999999,"attack":999999999999,"exp":999999999,"money":999999999,"mightdrop":["屠龙宝刀"]}
                ]
class Monster:
    def __init__(self,monster):
        self.name = monster["name"]
        self.hp = monster["hp"]
        self.attack = monster["attack"]
        self.exp = monster["exp"]
        self.money = monster["money"]
        self.mightdrop = monster["mightdrop"]
    def __str__(self):
        return self.name
    def bespecial(self):
        self.pre_name = random.choice(["*恶毒的","*邪恶的","可怕的*","离谱的","变态的"])
        self.name = self.pre_name + self.name
        self.hp = self.hp * ["*恶毒的","*邪恶的","可怕的*","离谱的","变态的"].index(self.pre_name) * 2
        self.attack = self.attack * ["*恶毒的","*邪恶的","可怕的*","离谱的","变态的"].index(self.pre_name) 
        self.exp = self.exp * ["*恶毒的","*邪恶的","可怕的*","离谱的","变态的"].index(self.pre_name)
        self.money = self.money * ["*恶毒的","*邪恶的","可怕的*","离谱的","变态的"].index(self.pre_name)
        